app/controllers/api/v1/campaigns_controller.rb

    def create
      @campaign = Campaign.new(campaign_params)

      if @campaign.save
---
INSERT INTO "campaigns" ("name", "description", "goal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Alex's campaign"], ["description", "to pay attention to my presentation"], ["goal", 1], ["created_at", "2021-05-31 18:29:46.949550"], ["updated_at", "2021-05-31 18:29:46.949550"]]

    def destroy
      if @campaign.destroy
---
DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 16]]

    def set_campaign
        @campaign = Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]