app/controllers/api/v1/campaigns_controller.rb

SELECT "campaigns".* FROM "campaigns"
---
    def index
        @campaigns = Campaign.all

INSERT INTO "campaigns" ("name", "description", "goal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
      @campaign = Campaign.new(campaign_params)

      if @campaign.save

UPDATE "campaigns" SET "name" = $1, "description" = $2, "goal" = $3, "updated_at" = $4 WHERE "campaigns"."id" = $5  [["name", "sample event"], ["description", "sample event"], ["goal", 0], ["updated_at", "2021-05-27 15:23:35.897808"], ["id", 9]]
---
    def update
      if @campaign.update(campaign_params)

DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 20]]
DELETE FROM "donations" WHERE "donations"."id" = $1  [["id", 65]]
DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 66]]
---
    def destroy
      @campaign.donations.destroy_all
      if @campaign.destroy

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
---
    def set_campaign
        @campaign = Campaign.find(params[:id])