app/controllers/api/v1/donations_controller.rb

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "donations" ("comment", "price", "campaign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "hi"], ["price", 11111.0], ["campaign_id", 19], ["created_at", "2021-05-27 18:47:24.551973"], ["updated_at", "2021-05-27 18:47:24.551973"]]
---
  def create
    campaign = Campaign.find_by(id: params[:campaign_id])
    @donation = campaign.donations.build(donation_params)

    if @donation.save